---
kind: property
id: P:Autodesk.Revit.DB.ExternalGeometryId.Id
source: html/f10c7d77-a6ab-d327-986f-444c6d2f0f6f.htm
---
# Autodesk.Revit.DB.ExternalGeometryId.Id Property

External geometry identifier.

## Syntax (C#)
```csharp
public string Id { get; }
```